export default function AccountIcon({ className, isActive }: { className?: string; isActive?: boolean }) {
  return (
    <svg 
      className={className}
      width="26" height="26" viewBox="0 0 40 40" 
      fill="none" xmlns="http://www.w3.org/2000/svg"
    >
      <path 
        d="M19.8441 24.9795C21.9847 24.9795 24.3585 25.2853 26.9681 25.9033C29.5531 26.5156 31.9128 27.5173 34.0501 28.9082C36.1639 30.2838 37.1037 31.7645 37.1038 33.333V37.3125H2.58331V33.333C2.58344 31.7645 3.52326 30.2838 5.63702 28.9082C7.77433 27.5173 10.1341 26.5156 12.7191 25.9033C15.3288 25.2852 17.7033 24.9795 19.8441 24.9795ZM19.8441 2.6875C22.1772 2.68758 24.1505 3.50367 25.7923 5.14551C27.4341 6.78739 28.2503 8.76055 28.2503 11.0938C28.2503 13.427 27.4341 15.4001 25.7923 17.042C24.1505 18.6838 22.1772 19.4999 19.8441 19.5C17.5108 19.5 15.5367 18.6839 13.8948 17.042C12.2531 15.4001 11.4378 13.4269 11.4378 11.0938C11.4378 8.76062 12.2531 6.78736 13.8948 5.14551C15.5367 3.5036 17.5108 2.6875 19.8441 2.6875Z" 
        stroke="currentColor" 
        strokeWidth="2"
        strokeLinejoin="round"
        /* Магія заливки: коли активно — повністю зафарбовується, коли ні — залишається лише контур */
        fill={isActive ? "currentColor" : "none"}
      />
    </svg>
  );
}